{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "Stand with your arms out in front of you at chest height.
Hold a resistance band tightly between your hands so the band is parallel to the ground.
Keeping both arms straight, pull the band toward your chest by moving your arms outward. Initiate this motion from your mid-back.
Keep your spine straight as you squeeze your shoulder blades together. Pause briefly, then slowly return to the starting position.
Repeat 12 to 15 times. Perform 2 to 3 sets.
Grab a dumbbell in each hand and stand with your feet shoulder-width apart.
Bend your knees slightly and bring your torso forward by bending at the waist. Your arms should be extended with the dumbbells close to your knees. Keep your core engaged throughout the movement.
Keeping your upper body still, engage the muscles in your back, bend your arms, and pull the dumbbells up to your side. Aim for your ribcage.
Pause and squeeze at the top.
Slowly lower the weights to the starting position.
Repeat 10 to 12 times. Perform 2 to 3 sets.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyFemalePremium%2F25%20MINUTE%20UPPER%20BODY%20AND%20CORE%20WORKOUT%20%5B%20TONE%2C%20SCULPT%2C%20TIGHTEN%20CORE%5D%20FOR%20ALL%20FITNESS%20LEVELS.mp4?alt=media&token=5a553fbd-6b4c-4a9d-ac32-9e8a42490487" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale11.jpg?alt=media&token=5bbc3161-4788-4181-88e0-b40e2cc3a7cc",
      "title" : "25 MINUTE UPPER BODY AND CORE WORKOUT"
    }, {
      "description" : "Our bodies do not work in isolation, but it moves as a whole. By understanding the concept of the kinetic chain which describes the interrelated groups of body segments, muscles, and joints that work together to perform a movement; you can approach the push up as a full body integrated movement, and not as an upperbody only kind of movement. 

Engaging your entire body and keeping it engaged from your feet to you head by squeezing your ankles, legs, glutes, and core is key to maintain proper alignment. 

A push up is nothing but a moving plank. Mastering your planks help you build  the muscular endurance/strength needed to keep all abdominal and accessory muscles involved in a push up working together to maintain posture during the push up. A weak core is a week push up. 

Once you have mastered your planks building enough endurance to hold your body weight in these positions, play around with every progression listed on this video. 

Repetition will be your best friend. Your body is a machine that adapts to whatever stress you out it through. Adding every progression two-three times a week on your weekly routine will help you get your first push up and/or make your push ups 100% better than what you were doing before.

A good reference to have is to perform as many repetitions as you can without losing alignment or form for that progression. 

Rest 2 mins or more if needed in between sets to allow your body enough recovery to perform the next set with equal effort. 

A good rule per progression would be to add 3 sets of a particular progression three times a week to your workout regimen. ",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyFemalePremium%2FSTOP%20DOING%20GIRL%20PUSH%20UPS%20AND%20DO%20THEM%20RIGHT%20(THE%20PERFECT%20PROGRESSION%20FOR%20WOMEN%20AND%20BEGINNERS)..mp4?alt=media&token=00fe5af6-0251-483c-8042-69447d55aba9" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale33.jpg?alt=media&token=445cc01e-1d6d-49de-9f74-78b9ff751f87",
      "title" : "STOP DOING GIRL PUSH UPS AND DO THEM RIGHT"
    },{
      "description" : "1. Overhead press
      Reps: 12
Hold a set of dumbbells and bend your elbows to 90 degrees, with upper arms parallel to the floor and dumbbells at about head height.
As you exhale, press the dumbbells overhead without clanking them together. Return to starting position and keep resistance by preventing elbows from drooping below shoulder height.
      
      2. Triceps kickback
Reps: 12
Hold a dumbbell in each hand. Hinge forward at hips, keeping core tight and back flat. Bending elbows, glue upper arms to your sides.
On an exhale, straighten arms as much as possible. Inhale and bend elbows to return to starting position. Be sure to maintain neutral spine and neck position.
      
      3. Chest press
      Reps: 12
Lie faceup on a mat, holding a dumbbell in each hand. Bring elbows out in line with shoulders to create a 90-degree angle.
Press the dumbbells up without clanking them together, focusing on engaging chest muscles. Lower the dumbbells back to starting position.
      
      1. Side plank with lateral raise
      Reps: 12 per side

Start in a side plank, either full or modified by keeping your bottom knee on the floor. Hold a light dumbbell in your top hand. Bring dumbbell in front of the center of your core.

Keeping arm slightly bent, lift dumbbell to shoulder height. Return to starting position.

For more of a challenge, you can lift your top leg and touch it to the dumbbell after each rep.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyFemalePremium%2FTHIS%20WILL%20CHANGE%20THE%20WAY%20YOU%20TRAIN%20YOUR%20UPPER%20BODY%20-%20Back%2C%20shoulders%2C%20core%20of%20steel%20Massy%20Ari.mp4?alt=media&token=7ebabc05-70dc-4ea2-8960-cd23849b15b0" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale44.jpg?alt=media&token=19aac6df-3197-418c-93d9-865a927e45c1",
      "title" : "THIS WILL CHANGE THE WAY YOU TRAIN YOUR UPPER BODY"
    }, {
      "description" : "
      This circuit workout uses a 40-30-20, time-drop format.

40-30-20 represent the “work time” to be completed each set. So the “work time” drops by ten seconds each set (and rest time also decreases by 5 seconds each set).
      
      Strength: 2 Bicep Curls + 2 Standing Chest Flys
Cardio: Push Press
Strength: 3-Way Back Row
Cardio: Plank Position 4 Mountain Climbers + 1 Push Up
1-Minute BURNOUT",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyFemalePremium%2FUPPER%20BODY%20AT%20HOME%20OR%20GYM%2030%20MINUTE%20PARTNER%20WORKOUT.mp4?alt=media&token=02181de9-431d-420e-9f1e-b815f974024d" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FFemaleThumbnails%2Fupperfemale55.jpg?alt=media&token=eedf6e93-8633-41d8-b8a9-2f62ebc2cded",
      "title" : "UPPER BODY AT HOME OR GYM 30 MINUTE PARTNER WORKOUT"
    } ]
  } ]
}
